spec/platform/hedron/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-25 Thu 10:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>System.Hedron</title>
<meta name="author" content="Connor Redfern" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../../../doc-style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">System.Hedron</h1>
<p>
<a href="../index.html">up</a>
</p>
<div id="outline-container-org60c4f95" class="outline-2">
<h2 id="org60c4f95">Types</h2>
<div class="outline-text-2" id="text-org60c4f95">
<dl class="org-dl">
<dt>Surface</dt><dd>Type</dd>
<dt>ShaderModule</dt><dd>Type</dd>
<dt>Pipeline</dt><dd>Type</dd>
<dt>InputRate</dt><dd>Type</dd>
<dt>BindingDescription</dt><dd>Type</dd>
<dt>IndexFormat</dt><dd>Type</dd>
<dt>InputFormat</dt><dd>Type</dd>
<dt>DecriptorType</dt><dd>Type</dd>
<dt>StageType</dt><dd>Type</dd>
<dt>DescriptorBinding</dt><dd>Type</dd>
<dt>AttributeDescription</dt><dd>Type</dd>
</dl>
</div>
<div id="outline-container-org9e44006" class="outline-3">
<h3 id="org9e44006">Data</h3>
<div class="outline-text-3" id="text-org9e44006">
<dl class="org-dl">
<dt>BufferSort</dt><dd>Type</dd>
<dt>Buffer</dt><dd>Type</dd>
<dt>Image</dt><dd>Type</dd>
<dt>ImageFormat</dt><dd>Type</dd>
</dl>
</div>
</div>
<div id="outline-container-orgc6a985a" class="outline-3">
<h3 id="orgc6a985a">Command Buffers</h3>
<div class="outline-text-3" id="text-orgc6a985a">
<dl class="org-dl">
<dt>PipelineStage</dt><dd>Type</dd>

<dt>CommandPool</dt><dd>Type</dd>
<dt>CommandBuffer</dt><dd>Type</dd>
<dt>CommandBufferUsage</dt><dd>Type</dd>
</dl>
</div>
</div>
<div id="outline-container-orgef0386a" class="outline-3">
<h3 id="orgef0386a">Synchronisation</h3>
<div class="outline-text-3" id="text-orgef0386a">
<dl class="org-dl">
<dt>Semaphore</dt><dd>Type</dd>
<dt>Fence</dt><dd>Type</dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-org3d57473" class="outline-2">
<h2 id="org3d57473">Functions</h2>
<div class="outline-text-2" id="text-org3d57473">
<dl class="org-dl">
<dt>create-window-surface</dt><dd>Proc [Window] Surface</dd>
<dt>resize-window-surface</dt><dd>Proc [Surface (Pair U32 U32)] Unit</dd>
<dt>destroy-window-surface</dt><dd>Proc [Surface] Unit</dd>
<dt>num-swapchain-images</dt><dd>Proc [Surface] U32</dd>
<dt>create-shader-module</dt><dd>Proc [(List U8)] ShaderModule</dd>
<dt>destroy-shader-module</dt><dd>Proc [ShaderModule] Unit</dd>

<dt>create-pipeline</dt><dd><div class="org-src-container">
<pre class="src src-relic">  <span style="color: #b294bb;">Proc</span> [(<span style="color: #81a2be;">List</span> (<span style="color: #b294bb;">Struct</span> [<span style="color: #f0c674;">.type</span> (<span style="color: #b294bb;">Enum</span> <span style="color: #f0c674;">:uniform-buffer</span>)] [<span style="color: #f0c674;">.stage-type</span> (<span style="color: #b294bb;">Enum</span> <span style="color: #f0c674;">:vertex-shader</span>)]))
        (<span style="color: #81a2be;">List</span> (<span style="color: #b294bb;">Struct</span> [<span style="color: #f0c674;">.binding</span> <span style="color: #81a2be;">U32</span>] [<span style="color: #f0c674;">.stride</span> <span style="color: #81a2be;">U32</span>] [<span style="color: #f0c674;">.input-rate</span> (<span style="color: #b294bb;">Enum</span> <span style="color: #f0c674;">:vertex</span> <span style="color: #f0c674;">:instance</span>)]))
        (<span style="color: #81a2be;">List</span> (<span style="color: #b294bb;">Struct</span> [<span style="color: #f0c674;">.binding</span> <span style="color: #81a2be;">U32</span>] [<span style="color: #f0c674;">.location</span> <span style="color: #81a2be;">U32</span>] [<span style="color: #f0c674;">.format</span> (<span style="color: #b294bb;">Enum</span> <span style="color: #f0c674;">:float-1</span> <span style="color: #f0c674;">:float-2</span> <span style="color: #f0c674;">:float-3</span>)] [<span style="color: #f0c674;">.offset</span> <span style="color: #81a2be;">U32</span>]))
        (<span style="color: #81a2be;">List</span> <span style="color: #81a2be;">ShaderModule</span>)
        <span style="color: #81a2be;">Surface</span>] <span style="color: #81a2be;">Pipeline</span>
</pre>
</div></dd>

<dt>destroy-pipeline</dt><dd>Proc [Pipeline] Unit</dd>
</dl>
</div>
<div id="outline-container-org3335a98" class="outline-3">
<h3 id="org3335a98">Data and Buffers</h3>
<div class="outline-text-3" id="text-org3335a98">
<dl class="org-dl">
<dt>create-buffer</dt><dd></dd>
</dl>
<div class="org-src-container">
<pre class="src src-relic"><span style="color: #b294bb;">Proc</span> [<span style="color: #81a2be;">InputRate</span> <span style="color: #81a2be;">U64</span>] <span style="color: #81a2be;">Buffer</span>
</pre>
</div>
<p>
Creates a buffer on the device, 
</p>
<ul class="org-ul">
<li>buffer-type : indicate HOW data is to be fed into shaders, with
vertex indicating that it stores vertices, index indicating that it is
indexing <i>into</i> the vertex buffer, Uniform indicates that this is global
for a single invocation.</li>
</ul>

<dl class="org-dl">
<dt>destroy-buffer</dt><dd>Proc [Buffer] Unit</dd>
<dt>set-buffer-data</dt><dd>Proc [Buffer Address] Unit</dd>

<dt>create-image</dt><dd>Proc []</dd>
</dl>
</div>
</div>
<div id="outline-container-org2972dd6" class="outline-3">
<h3 id="org2972dd6">Commands</h3>
<div class="outline-text-3" id="text-org2972dd6">
<dl class="org-dl">
<dt>create-command-pool</dt><dd>Proc [] CommandPool</dd>
<dt>destroy-command-pool</dt><dd>Proc [CommandPool] Unit</dd>
<dt>create-command-buffer</dt><dd>Proc [CommandPool] CommandBuffer</dd>
<dt>free-command-buffer</dt><dd>Proc [CommandPool CommandBuffer] Unit</dd>

<dt>queue-submit</dt><dd>Proc [CommandBuffer (Maybe Fence) (List (Pair PipelineStage Semaphore)) (List Semaphore)] Unit</dd>
<dt>queue-present</dt><dd>Proc [Surface Semaphore U32] Unit</dd>
<dt>command-begin</dt><dd>Proc [CommandBuffer CommandBufferUsage] Unit</dd>
<dt>command-end</dt><dd>Proc [CommandBuffer] Unit</dd>
<dt>reset-command-buffer</dt><dd>Proc [CommandBuffer] Unit</dd>
<dt>command-begin-renderpass</dt><dd>Proc [CommandBuffer Surface U32] Unit</dd>
<dt>command-end-renderpass</dt><dd>Proc [CommandBuffer] Unit</dd>
<dt>command-bind-pipeline</dt><dd>Proc [CommandBuffer Pipeline] Unit</dd>
<dt>command-bind-vertex-buffer</dt><dd>Proc [CommandBuffer Buffer] Unit</dd>
<dt>command-bind-index-buffer</dt><dd>Proc [CommandBuffer Buffer (Enum ::u16 ::u32)] Unit</dd>
<dt>command-set-surface</dt><dd>Proc [CommandBuffer Surface] Unit</dd>
<dt>command-draw</dt><dd>Proc [CommandBuffer U32 U32 U32 U32] Unit</dd>
<dt>command-draw-indexed</dt><dd>Proc [CommandBuffer U32 U32 U32 I32 U32] Unit</dd>
</dl>
</div>
</div>
<div id="outline-container-orgbd00ad1" class="outline-3">
<h3 id="orgbd00ad1">Syncrhonisation</h3>
<div class="outline-text-3" id="text-orgbd00ad1">
<dl class="org-dl">
<dt>create-semaphore</dt><dd>Proc [] Semaphore</dd>
<dt>destroy-semaphore</dt><dd>Proc [Semaphore] Unit</dd>
<dt>create-fence</dt><dd>Proc [] Fence</dd>
<dt>destroy-fence</dt><dd>Proc [Fence] Unit</dd>
<dt>wait-for-fence</dt><dd>Proc [Fence] Unit</dd>
<dt>reset-fence</dt><dd>Proc [Fence] Unit</dd>
<dt>wait-for-device</dt><dd>Proc [] Unit</dd>
<dt>acquire-next-image</dt><dd>Proc [Surface Semaphore] (Enum [::image U32] ::resized)</dd>
</dl>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Connor Redfern</p>
<p class="date">Created: 2025-12-25 Thu 10:01</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
